# QA practice — Kamkombank (mobile)

## ℹ️ Общая информация

Сайт: [kamkombank.ru](http://kamkombank.ru/)

Платформа: Mobile Web

Устройство: iPhone

Браузер: Chrome

---

##  Найденные баги / UX issues

### 1. Мобильный скролл не срабатывает с первого раза

Тип: UX / Usability

Severity: Low

Steps to reproduce:

1. Открыть главную страницу сайта
2. Попробовать проскроллить вниз
3. Повторить жест 2–3 раза

Actual result:
Скролл часто не срабатывает с первого раза

Expected result:
Страница прокручивается с первого свайпа

Notes:
Создаёт ощущение неотзывчивого интерфейса

![IMG_3554.png](attachment:06f182a9-ee4f-4feb-9154-ab43fdcfa3d0:IMG_3554.png)

### 2. Смещение элементов интерфейса в калькуляторе кредита

Тип: UI

Severity: Low

Steps to reproduce:

1. Открыть страницу калькулятора потребительского кредита
2. Изменить параметры расчёта (сумма / переключатели)
3. Наблюдать поведение интерфейса

Actual result:
Элементы интерфейса смещаются, создаётся ощущение "съезда" верстки

Expected result:
Интерфейс остаётся стабильным при взаимодействии

Notes:
Проблема визуальная, не блокирует сценарий, но снижает доверие к интерфейсу

📸 Screenshot:
(скрин)
